"""
----------------------- TASK 17 -----------------------

    ПРАВИЛО:
    Если отношение похоже на "является", но тип наследуемого
    объекта по логике работы программы может меняться, то
    правильным отношением будет "содержит".

    Приведите два словесных примера отношения "содержит" между
    классами, которое похоже на "является", но по вышеупомянутому
    правилу таковым не является.

1)

----------------------- TASK 18 -----------------------

    Приведите два словесных примера отношения "является" между
    классами, которое однозначно таковым является и не может быть
    переведено в отношение "содержит".

1)


"""
